
# 🎯 예제14. 대소문자 변환 함수를 사용할 수 있어야해요 !
   
# 😊 문자함수 비교 
# 
# SQL                      vs                 R  
# 
# upper                                     toupper       
# lower                                     tolower
# substr                                     substr
# replace                                     gsub

# ➡️ 이름와 직업을 출력하는데 전부 소문자로 출력하시오 !




#➡️ emp 데이터 프레임의 ename 컬럼을 소문자로 변환합니다.




#😄 문제1. emp 데이터프레임의 직업도 소문자로 변환한후에 이름과 직업을
#          emp 데이터 프레임에서 출력하시오 !

  



#😄 문제2.  이름이 scott 인 사원의 이름과  월급을 출력하시오 ! 
#           이름을 소문자로 검색해도 출력될 수 있게 하시오 !
  




