# 🎯 예제34. R 에서의 함수를 생성하는 방법을 알아야해요
# 
# ➡️나에게 필요한 함수를 생성하게 되면 좋은점 ?  
# 
# 나에게 필요한 코드들만 따로 잘 모아서 편하게 작업하기 위해서 필요합니다.
# 
# 예:  어느 데이터 분석가의 함수 사용 사례:
# 
# 국민은행에서 좋은 스크립트를 생성했으면 이를 저장하고 
# 다음에 신한은행 프로젝트를 갔을때 저축한 코드를 사용하면서 
# 신한 은행에서 작성 코드를 또 업데이트를 합니다. 
# 그러면서 점점 코드가 발전하면서 자기만의 유용한 코드가 
# 생성되어 본인이 해야할 일을 더 수월하게 수행합니다.
# 
# ➡️ 문법1. 함수 기본 생성 문법 작성법 
# 
# 함수명 <- function(인수 또는 입력값) {  
# 계산 처리1
# 계산 처리2
# .........
# return(계산결과 반환) 
# }
# 
# ➡️ 문법2. 이름을 입력하면 해당 사원의 월급이 출력되는 함수를 생성하시오 !
# 
# 
# 
# 
# 
# 
# 
# 😊문제1.  위의 함수의 코드를 수정해서 다음과 같이 이름을 소문자로 입력해도
# 결과가 나오게 함수의 코드를 수정하시오 !
# 
# 힌트 :    SQL             vs           R
# 
# upper                    toupper
# 
# income("scott")
# 
# 답:
# 
# 
# 
# 
# 😊 문제2. 직업을 입력하면 해당 직업의 토탈월급이 출력되게하는 함수를 생성하시오!
# 직업을 소문자로 입력해도 출력되게하시오!
# 
# 
# 
# 
# 
# 
# 😊 문제3. 위의 코드를 수정해서 직업을 물어보게하고 입력하게 하시오 !
# 
# 
# 
# 
