
#🎯 예제13. 데이터를 정렬해서 출력할 수 있어야해요 !
  
#   SQL         vs               R
 
#  order  by              dataframe 에 내장된 order 함수
 
# 좀더 쉽게 데이터를 정렬하려면 doBy 패키지를 설치하고 
# orderBy 함수를 이용해서 정렬합니다.
# 
# ➡️ 이름과 월급을 출력하는데 월급이 높은 사원부터 출력하시오 !
  


# 😄 문제1. emp20 에서 이름과 나이를 출력하는데 나이가 높은 학생부터 
# 출력하시오 !
  


# 😄 문제2. 내가 현재 접속한 R 세션에서 활성화 되어있는 변수 리스트를 
# 출력하시오!
  


# 😄 문제3.  emp20 변수를 현재 작업공간에서 지워버리고 싶다면 ?
  



# 😄 문제4.  R 을 사용하다보면 기존에 남아있는 변수로 인해서 
# 데이터 분석 결과가 잘못 나오는 경우가 있습니다. 
# 그럴때는 데이터 분석하기에 앞서서
# 변수들을 모두 지우고 코드를 시작할 필요가 있습니다. 
# 변수를 모두 지우는명령어는 무엇인가요 ?
  


#➡️ doBy 패키지를 설치하고 사용해보겠습니다. 




# 사원 테이블에서 이름과 월급을 출력하는데 월급이 높은 사원부터 
# 출력하시오




# 설명:  ~ -sal : 높은것부터 출력
#        ~ sal :  낮은것부터 출력

# 만약 doBy 패키지를 이용하지 않고 order 내장함수로 직업이 SALESMAN인
# 사원들의 이름과 월급을 출력하는데 월급이 높은 사원부터 출력하는 
# 결과를 뽑으려면 코드가 여러줄이 필요합니다. 


#😄문제5.  직업이 SALESMAN 인 사원들의 이름과 월급을 출력하는데
# 월급이 높은 사원부터 출력하시오 !
  



#😄문제6. 이번에는 doBy 패키지 없이 문제25번을 수행하시오 !





#😄문제7.  emp20 테이블에서 나이가 20대인 학생들의 이름과 나이를 
#         출력하는데 나이가 높은 학생부터 출력하시오 !




  

