# 🎯예제36. R 에서의 loop 문 작성법을 알아야해요
# 
# 어떤 특정 실행문을 수작업 하지 않고 반복해서 수행하고 싶을 때 유용한 문법입니다.
# 
# ➡️문법1.  for loop 문 작성법
# 
# 
# for ( 루프변수  in  리스트 ) {
# 반복할 문장 
# }
# 
# 
# ➡️문법2. 1 부터 10까지 출력하시오 !
# 
# 
# 
# 
# 
# 
# 😊문제1. 위의 코드를 수정해서 숫자를 입력하면 해당 숫자까지 1번부터 출력되는
# 함수를 생성하시오 !
# 
# 답:
# 
# 
# 
# 
# 
# 😊문제2.   for  loop 문을 이용해서 구구단 2단을 출력하시오 !
# 
# 
# 
# 
# 
# 😊문제3.  문제2번 코드를 가지고 함수를 생성하는데 숫자를 넣으면
# 해당 숫자의 구구단이 출력되게 하시오 !
# 
# gugu_dan(3)
# 
# 3 x 1  =  3
# 3 x 2  =  6
# :
# 3 x 9 =  27
# 
# 답:   
# 
# 
# 
# 
# 😊문제4. 1부터 20까지의 숫자를 출력하는데 홀수만 출력하시오 ! ( 답글로 달아주세요)
# 
# 힌트: 10%%2  --> 0
# 
# 11%%2  ---> 1
# 
# 답:
# 
# 
# 
# 
# 
# 
# 😊문제5.   다음과 같이 숫자를 입력해서 실행하면 짝수 인지 홀수 인지가 출력되게하시오
# 
# what_num(2)  
# 
# 짝수 입니다. 
# 
# what_num(3)
# 
# 홀수 입니다.
# 
# 답:   
# 
# 
